---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomPlenumLightingParam
source: html/19e74dbf-247f-346c-c6af-e072dbbc7c59.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomPlenumLightingParam Property

"Plenum Lighting Contribution"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomPlenumLightingParam { get; }
```